//* 处理多个视图依赖或需要更改的状态
//* 单状态树下的模块化
const PLAY_MODE = {
  LOOP: Symbol("LOOP"), // 单曲循环
  RANDOM: Symbol("RANDOM"), // 随机播放
  LISTLOOP: Symbol("LISTLOOP") // 列表循环/顺序播放
};
export default {
  expandPlayer: false, // 是否展开播放器
  playing: false, // 是否处于播放状态 
  mode: PLAY_MODE.LISTLOOP,
  playlist: [], // 用户播放列表 >0 播放器显示
  currentIndex: -1, // 当前播放索引
  user: { //! 用户信息 可能需要分出模块
    userId: '',
    nickName: '',
    avatarUrl: ''
  },
  identified: false, // 已登录
  currentSong: { //~ 当前激活歌曲
    id: '',
    name: '',
    artists: [], // 当前激活歌曲作者 {id:[string], name: [string], imgUrl: [string]}
  }, 
  songCol: {
    id: '',
    name: '',
    songList: [],
  } // 当前歌单
  // searchHistory: [] // 搜索历史
};

/*
[{"id":1347529801,"name":"只要有想见的人，就不是孤身一人","artists":[{"id":956386,"name":"王源"}],"imgUrl":"https://p1.music.126.net/Ylf_pqhILuGhQjJ9VsXctA==/109951163881967978.jpg","url":"http://m10.music.126.net/20190306111953/9313e80ac1867d2620354ccbc303c7c3/ymusic/0352/045b/055b/48c51f873b318b31a57421205e5b9d8b.mp3","lyric":{"lyric":{"version":16,"lyric":"[00:00.000] 作曲 : Uru\n[00:00.593] 作词 : 唐恬\n[00:01.779]原曲：Uru《Remember》\n[00:03.779]制作人：郑楠@SBMS\n[00:33.431]花开过 悄然无息\n[00:35.971]蝉声在 夏末静谧\n[00:39.010]每一天 慢慢走过\n[00:42.339]而时光 却匆匆\n[00:45.280]\n[00:45.886]我们是 沿途的旅客\n[00:48.934]相遇多 蜿蜒离奇\n[00:51.733]像涟漪 边靠近 边失踪\n[00:56.054]\n[00:57.271]那些无声的告别 曾存在过吗？\n[01:03.453]我曾这样遇见你 怎么证明呢？\n[01:09.906]曾经同路的背影 以记忆关联 被时间带走\n[01:16.830]像一个一个 追不回的梦\n[01:22.501]\n[01:23.576]随夏日远去的你\n[01:28.582]隐没在回忆里 去时间的尽头\n[01:36.091]我带着失去的拥有 继续人海里漂流\n[01:42.471]告别过 孤单也温柔\n[01:48.181]\n[01:48.989]岁月唱沉默的歌\n[01:53.934]被它抹去的名字 再不能还给我\n[02:01.143]曾经的拥抱 是真的\n[02:04.614]也是真的 回不去了\n[02:07.829]明白 再见啊 永不能再见了\n[02:13.322]消失在时光中\n[02:17.470]\n[02:27.888]生命是 不断的离开\n[02:31.858]又不断 有人到达\n[02:34.227]就算是 善意的谎话\n[02:37.094]也感谢 你来过\n[02:40.765]\n[02:41.221]有一些 话还没讲完\n[02:44.058]有些事 没有答案\n[02:46.952]是多么 完美的遗憾\n[02:51.228]\n[02:52.703]那些无声的告别 曾存在过啊\n[02:58.285]我曾这样遇见你 已足够幸福了\n[03:05.446]故事一幕一幕 消失在风里 被时间带走\n[03:12.023]我空着双手 心却是满的\n[03:17.436]\n[03:18.738]随夏日远去的你\n[03:23.598]隐没在回忆里 消失在那个路口\n[03:30.720]每当我再次 抬起头\n[03:34.177]就连寂寞 也好温柔\n[03:37.230]走散的我们 仰望着同片天空\n[03:43.892]\n[03:44.335]就算夏天 逝去了 花也曾开过\n[03:47.515]在无人的角落\n[03:50.279]时光的 手一挥 快乐难过 不会有人记得\n[03:56.425]我也很高兴 和你遇见过\n[04:02.806]\n[04:06.647]随夏日远去的你\n[04:11.732]隐没在回忆里 去时间的尽头\n[04:18.818]我带着失去的拥有 继续人海里漂流\n[04:25.460]告别过 孤单也温柔\n[04:31.074]\n[04:32.393]岁月唱沉默的歌\n[04:37.497]被抹去的名字 再不能还给我\n[04:44.009]昨日在风中 挥着手\n[04:47.735]舍不得也 要走了\n[04:50.867]那就这样吧 在忘却里自由\n[04:56.537]在瞬间里永久\n[05:00.556]\n[05:04.960]制作助理：王子\n[05:06.217]录音：汝文博@SBMS\n[05:07.633]录音棚：SpeedBumps Music Studio\n[05:09.104]和声&和声编写：余昭源\n[05:10.470]吉他：薛峰\n[05:11.679]贝斯：薛峰\n[05:13.038]弦乐编写：王子 郑楠\n[05:14.331]弦乐监制：李朋\n[05:15.774]弦乐：国际首席爱乐乐团\n[05:17.201]混音：赵靖@SBMS\n[05:18.424]母带：赵靖@SBMS\n[05:19.677]混音母带录音室：SpeedBumps Music Studio\n[05:20.972]原曲：Uru《Remember》\n"},"klyric":{"version":0},"tlyric":{"version":0}},"album":75655454},{"id":1348936851,"name":"Show Me Love","artists":[{"id":85548,"name":"Above & Beyond"},{"id":27621,"name":"Armin van Buuren"}],"imgUrl":"https://p2.music.126.net/lBj3dcbdBdengJ0fK_n3vg==/109951163893705673.jpg","url":"http://m10.music.126.net/20190306111927/99d0b4fbfc3827111be9871e96aac74f/ymusic/5253/070e/075a/e9b71a51e00de52d70c400f4ca9944f4.mp3","lyric":{"lyric":{"version":3,"lyric":"[00:00.000] 作曲 : Paavo Siljamäki/Benno de Goeij/Jono Grant/Tony McGuinness/Armin van Buuren\n[00:02.808]Show me love\n[00:04.532]\n[00:32.520]Show me love\n[00:34.530]\n[01:47.697]Show me love\n[01:49.737]\n[02:17.548]Show me love\n[02:19.501]\n[02:40.339]Show me love\n[02:41.714]\n[03:25.207]Show me love\n"},"klyric":{"version":0,"lyric":null},"tlyric":{"version":0,"lyric":null}},"album":75727395},{"id":1348568908,"name":"蜂鸟","artists":[{"id":187229,"name":"吴青峰"}],"imgUrl":"https://p2.music.126.net/rQw-f1jS2PIDnY2DoYlO7w==/109951163890222255.jpg","url":"http://m10.music.126.net/20190306111924/4eb235c8cffb5df16aefdb5e15fb8d0d/ymusic/0f0b/0609/015c/8a6a8ac59c1ce4f63e75668f4c3a16ca.mp3","lyric":{"lyric":{"version":9,"lyric":"[00:00.000] 作曲 : 吴青峰\n[00:00.042] 作词 : 吴青峰\n[00:00.126]编曲：吴青峰\n[00:00.815]传说中人类在远早\n[00:03.514]住于黑暗的地下之遥\n[00:06.432]派出了娇小的蜂鸟\n[00:09.456]找到通往光明的隧道\n[00:12.528]飞过了一座一座岛\n[00:15.650]好想有一个地方落脚\n[00:18.446]把一个一个梦制造\n[00:21.481]会不会有人能够听到\n[00:26.207]寻找太阳的梦 自不量力说\n[00:29.109]自己也变成太阳的念头\n[00:32.059]有时候寂寞 几乎扛不动\n[00:35.047]咽在喉咙里无人诉说\n[00:37.713]我们到底在追求些什么\n[00:40.729]为何一直不断往前冲\n[00:43.615]捏出血的双手\n[00:45.648]忘了也能够 稍微退后\n[00:49.725]我们总是以为能够自由\n[00:52.713]回过头那世界却依旧\n[00:55.598]哎 爱它来的时候\n[00:57.611]紧握的拳头 别忘了捉那个梦\n[01:08.156]传说中愤怒的恶魔\n[01:10.841]曾让这地球四处着火\n[01:13.897]一只蜂鸟收集云朵\n[01:16.956]火在雨中变成了彩虹\n[01:19.914]我们在孤单中探索\n[01:22.809]危险世界美丽的渴求\n[01:25.910]就算这力量再微弱\n[01:29.017]也想牵你手一起挣脱\n[01:32.166]寻找太阳的梦 自不量力说\n[01:35.077]自己也变成太阳的念头\n[01:38.083]有时候寂寞 几乎扛不动\n[01:41.051]咽在喉咙里无人诉说\n[01:45.234]我们到底在追求些什么\n[01:48.208]为何一直不断往前冲\n[01:50.984]捏出血的双手\n[01:53.091]忘了也能够 稍微退后\n[01:57.190]我们总是以为能够自由\n[02:00.084]回过头那世界却依旧\n[02:03.100]哎 爱它来的时候\n[02:05.076]紧握的拳头 别忘了捉\n[02:09.798]那个梦 来到我的身旁 收拢世界的光\n[02:22.065]我想要成为自己 也成为你的光\n[02:33.165]我们到底在追求些什么\n[02:36.225]为何不断往前冲\n[02:39.412]捏出血的双手\n[02:41.136]忘了也能够 稍微退后\n[02:45.346]我们到底在追求些什么\n[02:49.882]为何一直不断往前冲\n[02:53.151]捏出血的双手\n[02:54.637]忘了也能够 稍微退后\n[02:58.716]我们总是以为能够自由\n[03:01.676]回过头那世界却依旧\n[03:04.642]哎 爱它来的时候\n[03:06.615]紧握的拳头  别忘了捉那个梦\n[03:17.110]我那个梦\n[03:20.247]我那个梦\n[03:26.039]寂寞中拍打的翅膀\n[03:28.982]终于找到你一起飞翔\n[03:31.949]渺小却带来了神话\n[03:35.112]你看这世界开满了花\n[03:40.278]制作人：吴青峰、黄少雍\n[03:40.477]配唱：吴青峰\n[03:40.648]电贝斯：黄少雍\n[03:40.814]合成器：黄少雍\n[03:40.975]混音 / 后制：黄少雍\n[03:41.145]混音录音室：鼠患Studio\n[03:41.313]主唱：吴青峰\n[03:41.467]合声：吴青峰\n[03:41.607]合声编写：吴青峰\n[03:41.776]制作协力：张育维\n[03:41.926]制作助理：林志龙\n[03:42.077]封面设计：陈柏轩\n[03:42.227]封面绘图：吴青峰\n[03:42.402]音乐制作发行：智慧大狗 x 天才联盟 \n[03:42.576]出品人：张葛\n[03:42.985]监制：崔恕、王明宇\n"},"klyric":{"version":0},"tlyric":{"version":0}},"album":75709225}]


*/